Documents/АктПриемкиПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктПриемкиПомещения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Соглосователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Соглосователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСоглосования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодписьОтозвана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтозвания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтозвания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктПриемкиПомещения/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекущийПользователь;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	ОткрытьФормуПодписи(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Отозвать(Команда)
	ОткрытьФормуПодписи(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодписи(ОтзывПодписи)

    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПодписи", ЭтаФорма);
	ОткрытьФорму("Документ.АктПриемкиПомещения.Форма.ФормаПодписи", Новый Структура("ОтзывПодписи", ОтзывПодписи), ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	

КонецПроцедуры // ОткрытьФормуПодписи()

&НаКлиенте
Процедура ПослеВыбораПодписи(Результат, ДополнительныеПараметры) Экспорт

	

КонецПроцедуры // ПослеВыбораПодписи()



&НаКлиенте
Процедура ВидимостьКнопокПодпись()

	ЕстьПользовательВПодписях = Ложь;
	
	Для каждого х Из Объект.Соглосователи Цикл
	
		Если х.Соглосователь = ТекущийПользователь И НЕ х.ПодписьОтозвана Тогда
			ЕстьПользовательВПодписях = Истина;
			Прервать;
		КонецЕсли;	
	
	КонецЦикла;
	
	Элементы.СоглосователиПодписать.Видимость 	= НЕ ЕстьПользовательВПодписях;
	Элементы.СоглосователиОтозвать.Видимость 	= ЕстьПользовательВПодписях;
	
КонецПроцедуры // ВидимостьКнопокПодпись()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийПользователь = омСотрудники.ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	НеПоказыватьВВыборе = Новый Массив;
	
	Для каждого х Из Объект.Помещения Цикл
		НеПоказыватьВВыборе.Добавить(х.Помещение);	
	КонецЦикла;
	
	омПомещениеКлиент.ОткрытьПодборПомещения(Объект, ЭтаФорма, , , НеПоказыватьВВыборе, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПомещения(Результат, ДополнительныеПараметры) Экспорт	

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Для каждого Помещение Из Результат Цикл
			
			НС = Объект.Помещения.Добавить();
			НС.Помещение = Помещение;
			
		КонецЦикла;
		
	Иначе 
		Если Результат.Количество() = 0 Тогда
		
			Возврат;	
		
		КонецЕсли;
		
		ДополнительныеПараметры.ТД.Помещение = Результат[0];
		
	КонецЕсли; 
	
КонецПроцедуры // ПослеВыбораЭлементовСделки()

&НаКлиенте
Процедура СделкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мПервыеПоещения = Новый Массив;
	
	Для каждого х Из Объект.Помещения Цикл
		
		Если мПервыеПоещения.Найти(х.Помещение) = Неопределено Тогда
			мПервыеПоещения.Добавить(х.Помещение);	
		Иначе
			
			Отказ = Истина;
			ПоказатьПредупреждение(, "Дубль помещения " + х.Помещение);
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
